Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/mental_health/mental_health_commission.html.txt.tmx
Source language: en
Languages: ga

source: The Mental Health Commission is an independent body established under the Mental Health Act 2001
ga: Is comhlacht neamhspleách é an Coimisiún Meabhair-Shláinte a bunaíodh faoin Acht Meabhair-Shlláinte 2001

source: The Commission's functions are to promote, encourage and foster high standards and good practices in the delivery of mental health services and to protect the interests of people who are detained in approved psychiatric centres
ga: Is é príomh chuspóir an Choimisiúin ná caighdeáin arda agus deá-chleachtas seirbhísí sláinte mheabhrach á gcur ar fáil a chur chun cinn gus a chothabháil agus chun leas na ndaoine atá faoi choinneáil in aonaid shíciatracha ceadaithe, a chosaint

source: The Commission has a number of responsibilities under the Act that include:
ga: Tá roinnt freagrachtaí ag an gCoimisiún faoin Acht lena n-áirítear:

source: • Appointing people to mental health tribunals to review the detention of involuntary patients and appointing a legal representative for each patient
ga: • Daoine a cheapadh chuig binsí meabhair-shláinte chun athbhreithniú a dhéanamh ar choinneáil othar neamhdheonacha agus chun ionadaí dlí a cheapadh i leith gach othair

source: • Establishing and maintaining a Register of Approved Centres that are inpatient facilities providing care and treatment for people with a mental illness and mental disorder
ga: • Clár de na hIonaid Síciatracha Cheadaithe a bhunú agus a chothabháil ar saoráidí d’othair chónaithe iad a sholáthraíonn cúram agus cóireáil do dhaoine a bhfuil meabhairghalar nó neamhord meabhrach ag dul dóibh

source: • Making rules regulating the use of specific treatments and interventions such as ECT (Electroconvulsive Therapy), seclusion and mechanical restraint
ga: • Rialacha a dhéanamh a rialáil ar úsáid cóireálacha agus idirghábhacha ar leith mar ECT (teiripe leictri-thritheamhach), leithlis agus srianadh meicniúil

source: • Developing codes of practice for people working in the mental health services and enable them to provide high quality care and treatment to service users
ga: • Cód cleachtais a fhorbairt do dhaoine atá ag obair sna seirbhísí meabhair-shláinte agus cur ar a gcumas cúram agus cóireáil ar ardchaighdeán a chur ar fáil d’úsáideoirí seirbhísí

source: • Appointing the Inspector of Mental Health Services who inspects approved psychiatric centres annually
ga: • Cigire na Seirbhísí Meabhair-Shláinte a cheapadh a dhéanann cigireacht ar ionaid síciatracha cheadaithe gach bliain

source: The Commission has 13 members
ga: Tá 13 ball ar an gCoimisiún

source: As required by the Mental Health Act 2001, members include:
ga: De réir forálacha an Acht Meabhair-Shláinte 2001, áiritear i measc na mball seo:

source: • Three registered practitioners of whom 2 are consultant psychiatrists
ga: • Trí chleachtóir cláraithe ina n-áiritear beirt mar shíciatraíthe comhairleacha

source: • A Health Service Executive (HSE) employee nominated by the HSE
ga: • Fostaí on bhFeidhmeannacht na Seirbhíse Sláinte

source: • A representative of the general public and
ga: • Ionadaí ón bpobal i gcoitinne agus

source: • Three representatives of voluntary bodies (at least 2 of whom must have or have had a mental illness)
ga: • Trí ionadaí ó chomhlachtaí deonacha (caithfidh beirt acu ar a laghad meabhairghalar a bheith orthu nó go raibh meabhairghalar ag dul dóibh)

source: You can read this guide to the Mental Health Commission (pdf)
ga: Féadfaidh tú an treoir chuig an gCoimisiún Meabhair-Shláinte (pdf) a léamh

source: The Mental Health Commission appoints mental health tribunals to automatically review all decisions to involuntarily detain patients or to extend the duration of such detentions under the provisions of the Mental Health Act, 2001. A mental health tribunal is a group of 3 people who review a person’s involuntary admission
ga: Ceapfaidh an Coimisiún Meabhair-Shláinte binsí meabhair-shláinte chun athbhreithniú uathoibreach a dhéanamh ar gach cinneadh chun othair a choinneáil go neamhdheonach nó chun síneadh ama a chuir leis an gcoinneáil faoi fhorálacha an Acht Meabhair-Shláinte 2001

source: When the Mental Health Commission receives a copy of an admission or renewal order, it must:
ga: Nuair a gheobhaidh an Coimisiún Meabhair-Shláinte cóip de ordú iontrála nó athnuachana, caithfidh sé:

source: • Refer the matter to a mental health tribunal
ga: • An cás a chuir faoi bhráid an bhinse meabhair-shláinte

source: • Assign a legal representative to represent the patient unless the patient personally engages one
ga: • Ionadaí dlíthiúil a shannadh chun feidhmiú ar son an othair, muna mbíonn ceann fostaithe ag an othar go pearsanta

source: • Arrange for a consultant psychiatrist to examine the patient; interview the consultant psychiatrist responsible for the patient's treatment and care; and review the patient's records in order to decide, in the interests of the patient, whether the patient is suffering from a mental disorder
ga: • Stiúradh a thabhairt i scríbhinn do bhall den phainéal síciatraithe comhairleacha an t-othar a scrúdú; agallamh a chur ar an síciatrach comhairleach a bhí freagrach as cóireáil agus cúram an othair; agus athbhreithniú a dhéanamh ar thaifead an othair chun go mbeadh siad in ann cinneadh a dhéanamh, ar mhaithe leis an othar, féachaint an bhfuil an t-othar ag fulaingt ó neamhórd meabhrach

source: The report must be presented by the consultant psychiatrist to the tribunal and to the patient's legal representative, within 14 days
ga: Caithfidh an tuairisc a bheith curtha i láthair ag an síciatrach comhairleach don bhinse agus do ionadaithe dlíthiúla an othair, taobh istigh de 14 lá

source: The mental health tribunal must review the detention of the patient and make a decision within 21 days of the making of the order
ga: Caithfidh an binse meabhair-shláinte coinneáil an othair a athbhreithniú agus cinneadh a dhéanamh taobh istigh de 21 lá ó dhéanamh an ordú

source: If the tribunal is satisfied that the patient is suffering from a mental disorder and that the proper procedures have been followed (or, if they have not, the failure does not affect the substance of the order and does not cause an injustice), it affirms the order
ga: Má tá an binse sásta go bhfuil an t-othar ag fulaingt ó neamhórd meabhrach agus gur leanadh na nósanna imeachta ceart (nó, mar a bhfuil, nach athraíonn an teipeadh substaint an ordaithe agus nach mbíonn aon éagóir ag baint leis), dearbhaíonn sé an t-ordú

source: If it is not satisfied, it revokes the order and directs that the patient be discharged
ga: Muna bhfuil sé sásta déanann sé cúlghairim ar an ordú agus ordaíonn sé an t-othar a scaoileadh abhaile

source: In order to carry out its functions, the tribunal has similar powers to a court, including the power to require the attendance of the relevant people and the production of documents
ga: Chun go mbeadh sé in ann na feidhmeanna seo a dhéanamh, tá na cumhachtaí céanna ag an mbinse agus atá ag an gcúirt, ina n-áiritear an chumhacht a éilíonn go bhfreastalaíonn na daoine cuí agus go gcuirfear cáipéisí ar fáil

source: The tribunal is, of course, obliged to respect the usual requirements of natural justice, for example, it must ensure that the patient has copies of the reports that are being considered by the tribunal
ga: Tá oibligeáid ar an mbinse, ár ndóigh, ómós a bheith acu do ghnáth éilimh cearta nádúrtha, m.sh., caithfidh sé a chinntiú go mbeidh cóipeanna dena tuairiscí atá faoi chaibidil ag an mbinse, le fáil ag an othar

source: The tribunal must notify its decision, in writing, to:
ga: Caithfidh an binse a chinneadh a chuir in iúl i scríbhinn, chuig:

source: • The psychiatrist responsible for the patient's care and treatment
ga: • An síciatraí atá freagrach as cúram agus cóireáil an othair

source: • The patient and their legal representative
ga: • An t-othar agus a c(h)uid ionadaithe dlíthiúla

source: • Any other person the tribunal considers should have notice
ga: • Aon duine eile a cheapann an binse gur chóir fógra a fháil

source: The review tribunal must consist of a lawyer as chairman, a consultant psychiatrist and a person who is not a lawyer or doctor
ga: Caithfidh dlídóir a bheith mar chathaoirleach an binse meabhair-shláinte , agus caithfidh go mbeidh síciatraí comhairleach agus duine nach dlídóir ná dochtúr é páirteach ann chomh maith

source: Members of the Commission may not serve on a tribunal
ga: Ní féidir le baill an Choimisiúin freastal a dhéanamh ar an mbinse

source: A further function of the tribunals, under the direction of the Mental Health Commission, is to consider any request for authorisation from a consultant psychiatrist to perform psycho-surgery on a patient where the patient gives their consent in writing to such treatment
ga: Ceann eile de fheidhmeanna na mbinsí, faoi stiúir An Choimisiún Meabhair-Shláinte, ná breithniú a dhéanamh ar aon éileamh ó shíciatraí comhairleach chun údarás a fháil le haghaidh sícemháinliacht a dhéanamh ar othar, nuair a thugann an t-othar a t(h)oil i scríbhinn i gcomhair an cinéal seo cóireála

source: If the tribunal is satisfied that such surgery is in the best interests of the person, it will authorise such surgery or where it is not so satisfied, refuse it. Where to apply Mental Health Commission St
ga: Má tá an binse sásta go bhfuil an mháinliacht seo ar mhaithe le leas an duine, tabharfaidh sé údarás do leithid de mháinliacht, nó mura bhfuil sé sásta diúltóidh sé dó
